app/views/favorites/index.html.erb

    <br>
    <div class='headplate'>Title:</div> <a href='/users/favorites/<%= favorite.id %>'><%= @movies.find(favorite.movie_id).title %></a><br>
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 8]]