app/views/favorites/show.html.erb

<br>
<h1>Movie Title: <%= @movies.find(@favorite.movie_id).title %></h1>
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 3]]