app/controllers/favorites_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 LIMIT 1  [["user_id", "1"]]
SELECT "movies".* FROM "movies"
---
  def index
    @user_id = current_user.id.to_s
    @favorites = Favorite.where(user_id: @user_id)
    @movies = Movie.all

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @favorite = Favorite.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "favorites" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "#<User:0x007f9b7f146168>"], ["movie_id", "#<Movie:0x007f9b7f13d6a8>"], ["created_at", "2016-01-17 15:58:06.002175"], ["updated_at", "2016-01-17 15:58:06.002175"]]
---
  def new
    @movie = Movie.find(params[:id])
    @favorite = Favorite.new
    @favorite.user_id = User.find(current_user).id
    @favorite.movie_id = Movie.find(params[:id]).id
    @favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 8]]
---
    def destroy
    @favorite = Favorite.find(params[:id])
    @favorite.destroy