app/controllers/movies_controller.rb

  def create
    movie = params.require(:movie).permit(:title, :genre, :year, :synopsis, :picture)
    Movie.create(movie)
---
INSERT INTO "movies" ("title", "genre", "year", "synopsis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Die Another Day"], ["genre", "Spy"], ["year", 2002], ["synopsis", "James Bond gets his."], ["created_at", "2016-01-13 23:52:57.671305"], ["updated_at", "2016-01-13 23:52:57.671305"]]

  def update
    @movie = Movie.find(params[:id])
    @movie.update_attributes(params.require(:movie).permit(:title, :genre, :year, :synopsis, :picture))
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "movies" SET "picture" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["picture", "http://i730.photobucket.com/albums/ww310/haleymayo/derp/DERP.jpg"], ["updated_at", "2016-01-14 14:13:00.452371"], ["id", 1]]